Tekla Open API Reference for Tekla Structures 2025
Position.Depth Property
 Indicates the positioning in the depth sense.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Position.DepthEnum Depth { get; set; }
Public Property Depth As Position.DepthEnum
	Get
	Set
Property Value
Type: Position.DepthEnum
See Also
Reference
Position Class
Tekla.Structures.Model Namespace